
/*
	1 C++初识

	2 数据类型

	3 运算符

	4 程序流程结构

		4.1 选择结构

		4.2 循环结构

			4.2.1 while循环语句

			while循环练习案例：猜数字

			4.2.2 do...while循环语句

			练习案例：水仙花数

			4.2.3 for循环语句

			练习案例：敲桌子

			4.2.4 嵌套循环

				作用： 在循环体中再嵌套一层循环，解决一些实际问题

				例如我们想在屏幕中打印如下图片，就需要利用嵌套循环

				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
				* * * * * * * * * *
*/

#include <iostream>

using namespace std;

int main()
{
	//外层循环执行1次，内层循环执行1轮
	for (int i = 0; i < 10; i++)
	{
		for (int j = 0; j < 10; j++)
		{
			cout << "*" << " ";
		}
		cout << endl;
	}

	return 0;
}