
/*
	KMP算法
		求next数组


		求模式串的next数组(手算练习)

			|   T       [g][o][o][g][l][e]
			|         0  1  2  3  4  5  6
			|
			|   next [ ][ ][ ][ ][ ][ ][ ]
			|            1  2  3  4  5  6
			|
			|   S[i]
			|   T[j]

			字符串的下标和数组的下标对应。
			next 数组：当模式串的第 j 个字符匹配失败时，令模式串跳到 next[j] 再继续匹配。

			任何模式串都一样，第一个字符不匹配时，只能匹配下一个子串，因此，往后余生，next[1]都无脑写0
				|   next [ ][0][ ][ ][ ][ ][ ]
				|            1  2  3  4  5  6

			任何模式串都一样，第二个字符不匹配时，因尝试匹配模式串的第一个字符，因此，往后余生，next[2]都无脑写1
				|   next [ ][0][1][ ][ ][ ][ ]
				|            1  2  3  4  5  6

			在匹配的位置前边，划一根分界线，模式串一步一步往后退，直到分界线之前 能对上，或模式串完全跨过分界线为止
				|                           |  i
				|                           |  ↓
				|   S       [?][?][?][g][o] | [?][?][?][?][?][?][?][?][?][?]
				|                           |  ×
				|   T                [g][o] | [o][g][l][e]
				|                     1  2  |  3  4  5  6
				|                           |  ↑
				|                           |  j
				|-----------------------------------------------------------
				|   移动一次 字符g 和 字符o 不匹配，应该继续往后移动
				|                           |  i
				|                           |  ↓
				|   S       [?][?][?][g][o] | [?][?][?][?][?][?][?][?][?][?]
				|                        ×  |
				|   T                   [g] | [o][o][g][l][e]
				|                        1  |  2  3  4  5  6
				|                           |  ↑
				|                           |  j
				|-----------------------------------------------------------
				|   检查 i 和 j 处的字符是否匹配，如果匹配失败，j = 1，此时 j 指向哪，next数组的值就是多少
				|                           |  i
				|                           |  ↓
				|   S       [?][?][?][g][o] | [?][?][?][?][?][?][?][?][?][?]
				|                           |
				|   T                       | [g][o][o][g][l][e]
				|                           |  1  2  3  4  5  6
				|                           |  ↑
				|                           |  j
				|
				|   next [ ][0][1][1][ ][ ][ ]
				|            1  2  3  4  5  6

			如果第四个字符匹配失败，在匹配的位置前面，划一根分界线，模式串一步一步往后退，直到分界线之前 能对上，或模式串完全跨过分界线为止
				|                              |  i
				|                              |  ↓
				|   S       [?][?][?][g][o][o] | [?][?][?][?][?][?][?][?][?]
				|                              |  ×
				|   T                [g][o][o] | [g][l][e]
				|                     1  2  3  |  4  5  6
				|                              |  ↑
				|                              |  j
				|-----------------------------------------------------------
				|   移动一次 字符g 和 字符o 不匹配，应该继续往后移动
				|                              |  i
				|                              |  ↓
				|   S       [?][?][?][g][o][o] | [?][?][?][?][?][?][?][?][?]
				|                        ×     |
				|   T                   [g][o] | [o][g][l][e]
				|                        1  2  |  3  4  5  6
				|                              |  ↑
				|                              |  j
				|-----------------------------------------------------------
				|   移动一次 字符g 和 字符o 不匹配，应该继续往后移动
				|                              |  i
				|                              |  ↓
				|   S       [?][?][?][g][o][o] | [?][?][?][?][?][?][?][?][?]
				|                           ×  |   
				|   T                      [g] | [o][o][g][l][e]
				|                           1  |  2  3  4  5  6
				|                              |  ↑
				|                              |  j
				|-----------------------------------------------------------
				|   检查 i 和 j 处的字符是否匹配，如果匹配失败，j = 1，此时 j 指向哪，next数组的值就是多少
				|                              |  i
				|                              |  ↓
				|   S       [?][?][?][g][o][o] | [?][?][?][?][?][?][?][?][?]
				|                              |
				|   T                          | [g][o][o][g][l][e]
				|                              |  1  2  3  4  5  6
				|                              |  ↑
				|                              |  j
				|
				|   next [ ][0][1][1][1][ ][ ]
				|            1  2  3  4  5  6

			如果第五个字符匹配失败，在匹配的位置前面，划一根分界线，模式串一步一步往后退，直到分界线之前 能对上，或模式串完全跨过分界线为止
				|                                 |  i
				|                                 |  ↓
				|   S       [?][?][?][g][o][o][g] | [?][?][?][?][?][?][?][?]
				|                                 |  ×
				|   T                [g][o][o][g] | [l][e]
				|                     1  2  3  4  |  5  6
				|                                 |  ↑
				|                                 |  j
				|-----------------------------------------------------------
				|   移动时，观察分界线左边的模式串和主串是否匹配，此时匹配。
				|   检查 i位置 和 j位置 是否匹配，如果不匹配，此时 j 指向哪，next数组的值就是多少
				|                                 |  i
				|                                 |  ↓
				|   S       [?][?][?][g][o][o][g] | [?][?][?][?][?][?][?][?]
				|                              √  |         
				|   T                         [g] | [o][o][g][l][e]
				|                              1  |  2  3  4  5  6
				|                                 |  ↑
				|                                 |  j
				|
				|   next [ ][0][1][1][1][2][ ]
				|            1  2  3  4  5  6

			如果第六个字符匹配失败，在匹配的位置前面，划一根分界线，模式串一步一步往后退，直到分界线之前 能对上，或模式串完全跨过分界线为止
				|                                    |  i
				|                                    |  ↓
				|   S       [?][?][?][g][o][o][g][l] | [?][?][?][?][?][?][?]
				|                                    |  ×
				|   T                [g][o][o][g][l] | [e]
				|                     1  2  3  4  5  |  6
				|                                    |  ↑
				|                                    |  j
				|-----------------------------------------------------------
				|   移动时，观察分界线左边的模式串和主串是否匹配，g匹配，o不匹配。应当再移动
				|                                    |  i
				|                                    |  ↓
				|   S       [?][?][?][g][o][o][g][l] | [?][?][?][?][?][?][?]
				|                              √  ×  |
				|   T                         [g][o] | [o][g][l][e]
				|                              1  2  |  3  4  5  6
				|                                    |  ↑
				|                                    |  j
				|-----------------------------------------------------------
				|   分界限前都不匹配，模式串完全跨过分界线为止。
				|   检查 i位置 和 j位置 是否匹配，如果不匹配，此时 j 指向哪，next数组的值就是多少
				|                                    |  i
				|                                    |  ↓
				|   S       [?][?][?][g][o][o][g][l] | [?][?][?][?][?][?][?]
				|                                    |  ×
				|   T                                | [g][o][o][g][l][e]
				|                                    |  1  2  3  4  5  6
				|                                    |  ↑
				|                                    |  j
				|
				|   next [ ][0][1][1][1][2][1]
				|            1  2  3  4  5  6

			next[1]都无脑写0
			next[2]都无脑写1

			其他next在不匹配的位置前，划分界线，模式串一步一步往后退，直到分界线之前 能对上，或模式串完全跨过分界线为止，
			此时 j 指向哪，next数组的值就是多少。

下一章 王道_38-4.2_4_KMP算法的进一步优化
*/