/*
	交换奇偶位
		写一个宏，可以将一个整数的二进制位的奇数位和偶数位交换。

		                                奇数位
		                                  ↓
		00000000 00000000 00000000 00001010
		                                 ↑
		                               偶数位

		十进制：10
		二进制：00000000 00000000 00000000 00001010

		交换后
		二进制：00000000 00000000 00000000 00000101


		二进制：：10101010 10101010 10101010 10101010
		十六进制：0xaaaaaaaa

		二进制：：01010101 01010101 01010101 01010101
		十六进制：0x55555555

		思路
			将偶数位拿出
				11111111 11111111 11111111 11111111
				按位与&
				10101010 10101010 10101010 10101010
				得到偶数位
			偶数位右移1位

			将奇数位拿出
				11111111 11111111 11111111 11111111
				按位与&
				01010101 01010101 01010101 01010101
				得到奇数位

			奇数位左移1位

			得到的结果相加
*/

#include <stdio.h>

#define 交换奇偶位(N) ((N & 0xaaaaaaaa) >> 1) + ((N & 0x55555555) << 1)

int main()
{
	int num = 10;
	//int ret = ((num & 0xaaaaaaaa) >> 1) + ((num & 0x55555555) << 1);
	int ret = 交换奇偶位(num);

	printf("%d\n", ret);

	return 0;
}