
#include "game.h"

void 初始化棋盘(char 棋盘[行S][列S], int rows, int cols, char 设置)
{
	int x = 0;
	int y = 0;

	for (x = 0; x < rows; x++)
	{
		for (y = 0; y < cols; y++)
		{
			棋盘[x][y] = 设置;
		}
	}
}





void 打印棋盘(char 棋盘[行S][列S], int row, int col)
{
	int x = 0;
	int y = 0;
	printf("--------扫雷游戏--------\n");

	// 打印列号
	for (x = 0; x <= col; x++)
	{
		printf("%d ", x);
	}
	printf("\n");
	
	// 打印棋盘
	for (x = 1; x <= row; x++)
	{
		printf("%d ", x);// 行号
		for (y = 1; y <= col; y++)
		{
			printf("%c ", 棋盘[x][y]);
		}
		printf("\n");
	}
	printf("--------扫雷游戏--------\n");
}





void 设置地雷(char 棋盘[行S][列S], int row, int col)
{
	// 布置10个雷
	int 雷 = 非常简单;
	while (雷)
	{
		// 生成随机的下标
		int x = rand() % row+1;
		int y = rand() % col+1;
		if (棋盘[x][y] == '0')
		{
			棋盘[x][y] = '1';
			雷--;
		}
	}
}



// 这个函数只是给 发现地雷 使用的 加上static后就只能在这个文件内使用
static int 获取地雷个数(char 地雷[行S][列S], int x, int y)
{
	// 周围8坐标加起来，因为是字符，所以8个坐标各自减去字符0，然后加起来。'0'-'0'=0,'1'-'0'=1
	// 
	return	地雷[x - 1][y] +
			地雷[x - 1][y - 1] +
			地雷[x][y - 1] +
			地雷[x + 1][y - 1] +
			地雷[x + 1][y] +
			地雷[x + 1][y + 1] +
			地雷[x][y + 1] +
			地雷[x - 1][y + 1] - 8 * '0';

	//// 循环写法
	//int i = 0;
	//int j = 0;
	//for (i = -1; i <= 1; i++)
	//{
	//	for (j = -1; j <= 1; j++)
	//	{
	//		地雷[x + i][y + j];
	//	}
	//}

}
void 发现地雷(char 地雷[行S][列S], char 显示[行S][列S], int row, int col)
{
	// 1.输入排查坐标
	// 2.检查坐标是不是雷
	//		是雷		死
	//		不是雷	统计坐标周围有几个雷 - 存储排查雷的信息到 显示 数组，游戏继续

	int x = 0;
	int y = 0;
	int 胜利 = 0;

	while (胜利 < row*col-非常简单)
	{
		printf("请输入要排查的坐标:横 竖>");
		scanf("%d %d", &x, &y);// x 1-9,y 1-9才是合法坐标

		// 判断坐标合法
		if (x >= 1 && x <= row && y >= 1 && y <= col)
		{
			if (地雷[x][y] == '1')
			{
				打印棋盘(地雷, row, col);
				printf("!!!!!!!! 死死死死 死 死死死死 !!!!!!!!\n");
				printf("!!!!!!!! 死死死死 死 死死死死 !!!!!!!!\n");
				printf("!!!!!!!! 死死死死 死 死死死死 !!!!!!!!\n");
				printf("!!!!!!!! 死死死死 死 死死死死 !!!!!!!!\n");
				printf("!!!!!!!! 死死死死 死 死死死死 !!!!!!!!\n");
				break;
			}
			else
			{
				// 不是雷	统计坐标周围有几个雷 - 存储排查雷的信息到 显示 数组，游戏继续
				int 个数 = 获取地雷个数(地雷, x, y);
				显示[x][y] = 个数 + '0';
				/*
					ASCLL
						0	'0' - 48
						1	'1' - 49
						2	'2' - 50
						3	

						3 + '0' = '3'
				*/

				打印棋盘(显示, row, col);

				胜利++;
			}
		}
		else
		{
			printf("坐标不合法，请重新输入\n");
		}
	}

	if (胜利 == row * col - 非常简单)
	{
		打印棋盘(显示, row, col);
		printf("-------- -------- 胜利 -------- --------\n");
		printf("-------- -------- 胜利 -------- --------\n");
		printf("-------- -------- 胜利 -------- --------\n");
		printf("-------- -------- 胜利 -------- --------\n");
		printf("-------- -------- 胜利 -------- --------\n");
	}
}

