/*
	编码的三种境界：
		1.看代码就是代码
		2.看代码就是内存
		3.看代码还是代码(编程像说话一样流畅)

	指针进阶
		1.字符指针
		2.数组指针
		3.指针数组
		4.数组传参和指针传参
		5.函数指针
		6.函数指针数组
		7.指向函数指针数组的指针
		8.回调函数
		9.指针和数组面试题的解析

		======== ======== ======== ======== ========

		指针初阶我们知道了指针的概念
			1.指针就是个变量，用来存放地址，地址唯一标识一块内存空间
			2.指针的大小是固定的4/8个字节(32位平台/64位平台)
			3.指针是有类型，指针的类型决定了指针的+-整数的步长，指针解引用操作的时候的权限
			4.指针的运算

		======== ======== ======== ======== ========

		1.字符指针
			char*

			一般使用
				char ch = 'w';
				char* pc = &ch;
				*pc = 'w';

			还有一种
				// 本质上是把"hello bit"这个字符串的首字符的地址存储在了ps中
				// 和char arr[] = "hello bit";不同，这种写法一定是把"hello bit"这个字符串放在了arr里
				char* ps = "hello bit";
				char arr[] = "hello bit";
				printf("%c\n", *ps);// h
				printf("%s\n", ps);// 打印字符串的时候给个起始位置的地址就能打印出来了
				printf("%s\n", arr);


			后面的hello bit.是常量字符串
				char* str3 = "hello bit.";

				严格写法
					const char* str3 = "hello bit.";
					虽然是常量字符串，但是*str3 = 'w';不会报错，加上const就会显示报错，语法更严谨

					const放在*的左边修饰的是指针指向的内容不能被修改

					(左边指向内容不能被修改,右边指向地址不能被修改)

		-------- -------- -------- -------- --------

		2.数组指针

		-------- -------- -------- -------- --------

		3.指针数组
			指针数组是一个存放指针的数组

			复习：
				int* arr[10];	// 整形指针的数组
				char* arr2[4];	// 一级字符指针的数组
				char** arr3[5]	// 二级字符指针的数组

			讲解在
				指针数组()
				指针数组2()

		-------- -------- -------- -------- --------
		-------- -------- -------- -------- --------
		======== ======== ======== ======== ========

*/

#include "define.h"

//题目
//以下程序运行结果是什么？
void 题目1()
{
	char str1[] = "hello bit.";
	char str2[] = "hello bit.";
	char* str3 = "hello bit.";
	char* str4 = "hello bit.";

	if (str1 == str2)// 不相同
	{
		printf("str1 and str2 are same\n");
	}
	else
	{
		printf("str1 and str2 are not same\n");
	}

	if (str3 == str4)// 相同
	{
		printf("str3 and str4 are same\n");
	}
	else
	{
		printf("str3 and str4 are not same\n");
	}

	/*
		str1和str2是两个数组
				  str1 指向的是空间1的
					↓
			空间1	hello bit.
			空间2	hello bit.
					↑
				  str2 指向的是空间2的

		str3和str4
			因为"hello bit."是常量字符串，
			两份相同的数据并且不能改，所以内存中只存一份

				  str3 指向的是空间3的
					↓
			空间3	hello bit.
					↑
				  str4 指向的是空间3的

		严格写法
			const char* str3 = "hello bit.";
			虽然是常量字符串，但是*str3 = 'w';不会报错，加上const就会显示报错，语法更严谨
			
			
		题目来自《剑指offer》49页
	*/
}

//章节内容讲解
void 指针数组()
{
	// 以下这样写应用场景非常少
	int a = 10;
	int b = 20;
	int c = 30;
	int* arr[3] = { &a,&b,&c };//存放整形指针的数组
	int i = 0;
	for (i = 0; i < 3; i++)
	{
		printf("%d ", *(arr[i]));// arr[i]现在是一个地址，括起来然后解引用，就找到了对应的值
	}
}

void 指针数组2()
{
	int a[5] = { 1,2,3,4,5 };
	int b[] = { 2,3,4,5,6 };
	int c[] = { 3,4,5,6,7 };

	int* arr[3] = { a,b,c };

	int i = 0;
	for (i = 0; i < 3; i++)
	{
		int j = 0;
		for (j = 0; j < 5; j++)
		{
			//printf("%d ", *(arr[i] + j));// arr[i]+j可以理解为arr[0] = a 里的 下标0的元素
			printf("%d ", arr[i][j]);// 可以写成这样，[j]可以转变为+j解引用
		}
		printf("\n");
	}

	/*
		模拟了二维数组，但是不是二维数组，二维数组里的元素是连续存放的
		现在这样写的里面三行都是独立的，只不过有前面有三个指针(a,b,c)统领起来了，让我们感觉像二维数组
	*/
}

int main()
{
	题目1();

	指针数组();

	printf("\n");

	指针数组2();


	return 0;
}