/*
	指针进阶
		9.指针和数组面试题的解析

			笔试题7()
			笔试题8()
*/

#include "define.h"

void 笔试题7()
{
	char* a[] = { "work","at","alibaba" };
		// a是数组，每个元素类型是char*，指针数组
		// 
		// 假设：char* p = "abcdef";，字符串首字符的地址放到p里
		// 
		//    a
		// [char*] → "work"		(把work字符串的 首字符w的地址 放到数组里面)
		// [char*] → "at"		
		// [char*] → "alibaba"	

	char** pa = a;
		// a数组名是首元素地址，第一个元素的地址，第一个元素的类型是char*，第一个元素的地址是char*的地址，char*的地址是一个一级指针的地址
		// 
		// [char*] → "work"
		// ↑
		// 二级指针，类型char**
		// 
		// 恰好将这个地址交给了pa，pa的类型是char**
		// 
		// char**
		// [     ] → [char*] → "work"
		// pa

	pa++;
		// pa   → [char*] → "work"
		// pa++ → [char*] → "at"
		//        [char*] → "alibaba"

	printf("%s\n", *pa);
		// s格式符，用来输出一个字符串
		// 
		//				[char*] → "at"
		//              ↑
		// *pa访问的是 这个元素的地址，这个里面是字符a的地址
		// 
		// 这里放字符a的地址，以%s格式打印，从a的地址向后打印字符串
		// 
		// 答案是：at
}

/**************************************************************************************************************************************************/

void 笔试题8()
{
	char* c[] = { "ENTER","NEW","POINT","FIRST" };
		// c是数组，每个元素类型是char*，指针数组
		// 数组初始化了4个字符串进去，实际上是放了4个字符串的 首字符的地址 到数组c里面
		// 
		//    c
		// [char*] → "ENTER"
		// [char*] → "NEW"
		// [char*] → "POINT"
		// [char*] → "FIRST"

	char** cp[] = { c + 3,c + 2,c + 1,c };
		// ———————————————————————————————————————————————————
		// cp是数组，初始化了4个元素进去，每个元素类型是char**，
		// 
		//	  cp	  c
		// [c + 3] [char*] 
		// [c + 2] [char*] 
		// [c + 1] [char*] 
		// [c    ] [char*] 
		// ———————————————————————————————————————————————————
		// c数组名是首元素地址
		// 
		// c
		// ↓
		// [char*] "ENTER"
		// ———————————————————————————————————————————————————
		// 所以
		// 
		//	  cp		c
		// [c + 3] → [char*] → "FIRST"
		// [c + 2] → [char*] → "POINT"
		// [c + 1] → [char*] → "NEW"
		// [c    ] → [char*] → "ENTER"
		// ———————————————————————————————————————————————————

	char*** cpp = cp;
		// ———————————————————————————————————————————————————
		// cp数组名，表示首元素地址
		// 
		// cp
		// ↓
		// [c + 3]
		// ———————————————————————————————————————————————————
		// cp数组名，表示首元素地址，首元素的类型是char**，char**是二级指针，二级指针的地址放到三级指针变量里
		// 	 cpp          cp        c
		// [char***] → [c + 3] → [char*] → "FIRST"
		//		       [c + 2] → [char*] → "POINT"
		//		       [c + 1] → [char*] → "NEW"
		//		       [c    ] → [char*] → "ENTER"
		// ———————————————————————————————————————————————————

	printf("%s\n", **++cpp);
		// ———————————————————————————————————————————————————
		// 前置++cpp，前置++，先++ 再使用
		// 
		// 	 ++cpp        cp        c
		//             [c + 3] → [char*] → "FIRST"
		// [char***] → [c + 2] → [char*] → "POINT"
		//		       [c + 1] → [char*] → "NEW"
		//		       [c    ] → [char*] → "ENTER"
		// ———————————————————————————————————————————————————
		// 解引用第一次，*++cpp，拿到元素[c + 2]
		// 解引用第二次，**++cpp，拿到[char*] 的内容 字符P的地址
		// %s格式打印，字符P的位置向后打印字符串
		// 
		// 答案是：POINT
		// ———————————————————————————————————————————————————

	printf("%s\n", *-- * ++cpp + 3);
		// ———————————————————————————————————————————————————
		// 先cpp+3还是++cpp？++的优先级更高
		// 之前已经++cpp了，这里再次前置++
		// 
		// 	 ++cpp        cp        c
		//             [c + 3] → [char*] → "FIRST"
		//             [c + 2] → [char*] → "POINT"
		// [char***] → [c + 1] → [char*] → "NEW"
		//		       [c    ] → [char*] → "ENTER"
		// ———————————————————————————————————————————————————
		// * 的优先级比 + 高，所以先解引用* ++cpp
		//          * ++cpp
		//             ↓
		// [char***] → [c + 1] → [char*] → "NEW"
		// 
		// 但是遗憾的是前面有--，--的意思是把[c + 1]里面的值-1，变成了[c    ]
		// 	 ++cpp        cp        c
		//             [c + 3] → [char*] → "FIRST"
		//             [c + 2] → [char*] → "POINT"
		// [char***] → [c    ] → [char*] → "ENTER"
		//		       [c    ] → [char*] → "ENTER"
		//                       [char*] → "NEW"
		// ———————————————————————————————————————————————————
		// --操作完成前面又是解引用，*-- * ++cpp，当变成[c    ]的时候，[c    ] → [char*] → "ENTER"，拿到了字符E的地址
		// ———————————————————————————————————————————————————
		// 字符E的地址+3
		//            E+3
		//             ↓
		// 0   1   2   3   4
		// E   N   T   E   R
		// ———————————————————————————————————————————————————
		// %s格式打印，字符E的位置向后打印字符串
		// 
		// 答案是：ER
		// ———————————————————————————————————————————————————

	printf("%s\n", *cpp[-2] + 3);
		// ———————————————————————————————————————————————————
		// cpp[-2]等价于*(cpp-2)
		// *cpp[-2]等价于**(cpp-2)
		// **(cpp-2)+3
		// ———————————————————————————————————————————————————
		// 当前cpp是 → [c    ] → [char*] → "ENTER"
		// 
		// cpp-2后 → [c + 3] → [char*] → "FIRST"
		// ———————————————————————————————————————————————————
		// 第一次解引用*(cpp-2)，拿到了[c + 3]
		// 第二次解引用**(cpp-2)，拿到了[char*] → "FIRST"，字符F的地址
		// ———————————————————————————————————————————————————
		// 字符F的地址+3
		//            F+3
		//             ↓
		// 0   1   2   3   4
		// F   I   R   S   T
		// ———————————————————————————————————————————————————
		// %s格式打印，字符E的位置向后打印字符串
		// 
		// 答案是：ST
		// ———————————————————————————————————————————————————

	printf("%s\n", cpp[-1][-1] + 1);
		// ———————————————————————————————————————————————————
		// cpp[-1]等价于*(cpp-1)
		// cpp[-1][-1]等价于*(*(cpp-1)-1)
		// *(*(cpp-1)-1)+1
		// ———————————————————————————————————————————————————
		// (cpp只是运算时的值-2，本身并没变)
		// (cpp[-2]我们可以把它当做解引用，并没有做运算)
		// 当前cpp是 → [c    ] → [char*] → "ENTER"
		// 
		// cpp-1后 → [c + 2] → [char*] → "POINT"
		// ———————————————————————————————————————————————————
		// 第一次解引用*(cpp-1)，拿到了[c + 2]
		// [c + 2]指向的是 → "POINT"
		// ———————————————————————————————————————————————————
		// [c + 2]-1，变成了[c + 1]，拿到的是
		// 	 ++cpp        cp        c
		//             [c + 3] → [char*] → "FIRST"
		//             [c + 1] → [char*] → "NEW"
		//             [c + 1] → [char*] → "NEW"
		//		       [c    ] → [char*] → "ENTER"
		//                       [char*] → "POINT"
		// ———————————————————————————————————————————————————
		// 第二次解引用*(*(cpp-1)-1)，拿到了[char*] → "NEW"，字符N的地址
		// ———————————————————————————————————————————————————
		// 字符N的地址+1，*(*(cpp-1)-1)+1
		//    N+1
		//     ↓
		// 0   1   2
		// N   E   W
		// ———————————————————————————————————————————————————
		// %s格式打印，字符E的位置向后打印字符串
		// 
		// 答案是：EW
		// ———————————————————————————————————————————————————
}

int main()
{
	笔试题7();

	笔试题8();

	return 0;
}